In [89]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression

In [90]:
df = pd.read_csv("F:/Education/DS_Roadmap/py-master/ML/2_linear_reg_multivariate/Exercise/hiring.csv")

In [91]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [92]:
df = pd.read_csv("F:/Education/DS_Roadmap/py-master/ML/2_linear_reg_multivariate/Exercise/hiring.csv", 
                 names=["experience", "test_score", "interview_score", "salary"], skiprows=1)

In [93]:
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [94]:
testscore_med = df.test_score.median()

In [95]:
testscore_med

8.0

In [96]:
df.test_score.fillna(testscore_med)

0     8.0
1     8.0
2     6.0
3    10.0
4     9.0
5     7.0
6     8.0
7     7.0
Name: test_score, dtype: float64

In [97]:
df.test_score = df.test_score.fillna(testscore_med)

In [98]:
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [60]:
pip install word2number

Collecting word2number
  Downloading word2number-1.1.zip (9.7 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5567 sha256=c834464e3cc4a781a4519fb345783e82653cbf88e4a4caaed99cd7534436f878
  Stored in directory: c:\users\aditya zarekar\appdata\local\pip\cache\wheels\a0\4a\5b\d2f2df5c344ddbecb8bea759872c207ea91d93f57fb54e816e
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1
Note: you may need to restart the kernel to use updated packages.

In [99]:
from word2number import w2n

In [100]:
print(w2n.word_to_num("two million three thousand nine hundred and eighty four"))

2003984

In [101]:
w2n.word_to_num("two")

2

In [102]:
df.experience

0       NaN
1       NaN
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [104]:
df.experience=df.experience.fillna("zero")

In [105]:
df

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [107]:
df.experience.apply(w2n.word_to_num)

0     0
1     0
2     5
3     2
4     7
5     3
6    10
7    11
Name: experience, dtype: int64

In [109]:
df

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [110]:
df.experience = df.experience.apply(w2n.word_to_num)

In [111]:
df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000

In [112]:
reg = LinearRegression()

In [113]:
reg.fit(df[["experience","test_score", "interview_score"]], df.salary)

LinearRegression()

In [114]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [115]:
reg.intercept_

17737.26346433771

In [116]:
reg.predict([[2,9,6]])

C:\Users\Aditya Zarekar\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53205.96797671])

In [117]:
reg.predict([[12,10,10]])

C:\Users\Aditya Zarekar\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([92002.18340611])